STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA52CG/Applications/BLE/BLE_SerialCom_Central/STM32_WPAN/App/gatt_client_app.c
static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt)
{
  APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */

/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  GATT_CLIENT_APP_Discover_services(0);
  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */
static void COC_CENTRAL_APP_Terminal_Init(void)
{
  RxUART_Init();

  return;
}

static void RxUART_Init(void)
{
  UART_StartRx(COC_Central_APP_Terminal_UART_RxCpltCallback);
}

static void COC_Central_APP_Terminal_UART_RxCpltCallback( uint8_t *pdata, uint16_t size, uint8_t error )
{  
  uint8_t byte_received;
    
  if(size == 1)
  {
    byte_received = pdata[0];
    
    if(buffUartRxIndex < sizeof(a_buffUartRx))
    {
      a_buffUartRx[buffUartRxIndex++] = byte_received;
    }
    else
    {
      buffUartRxIndex = 0;
    }
    
    if( (byte_received == '\n') || (buffUartRxIndex >= sizeof(a_buffUartRx)))
    {
      memcpy(&a_buffCocTx[0], &a_buffUartRx[0], buffUartRxIndex);
      buffCocTxLen = buffUartRxIndex;
      
      buffUartRxIndex = 0;
      UTIL_SEQ_SetTask(1 << CFG_TASK_COC_CENTRAL_TX_REQ_ID, CFG_SCH_PRIO_0);      
    }    
  }
  else
  {
    
  }
  UART_StartRx(COC_Central_APP_Terminal_UART_RxCpltCallback);
  
  return;
 }

void CentralSendData( void )
{
  tBleStatus status = BLE_STATUS_INVALID_PARAMS;
  
  /* Data Packet to send to remote */
  status = aci_l2cap_coc_tx_data(BleCoCContextCentral.Channel_Index_List, 
                                 buffCocTxLen, 
                                 (uint8_t *) &a_buffCocTx[0]);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_l2cap_coc_tx_data : Fail, reason: 0x%02X\n", status);
  }
  BleStackCB_Process();
  return;
}

void COC_CENTRAL_APP_Notification(COC_APP_ConnHandle_Not_evt_t *pNotification)
{
  tBleStatus        ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t i;

  switch(pNotification->CoC_Evt_Opcode)
  {    
  case BLE_CONN_HANDLE_EVT :    
    BleCoCContextCentral.Conn_Handle = pNotification->ConnectionHandle;
    
    break;
  
  case BLE_CONN_UPDATE_EVT:
    BleCoCContextCentral.SPSM = 0x0002;
    BleCoCContextCentral.Max_Transmission_Unit = 0x0023;
    BleCoCContextCentral.Max_Payload_Size = 0x0023;
    BleCoCContextCentral.Initial_Credits = 0x0003;
    BleCoCContextCentral.Channel_Number = 0x01;
    
    if (BleCoCContextCentral.cocFlag != 1)
    {
      APP_DBG_MSG("==>> Start Connection Oriented Channel\n");
      ret = aci_l2cap_coc_connect(BleCoCContextCentral.Conn_Handle, 
                                  BleCoCContextCentral.SPSM, 
                                  BleCoCContextCentral.Max_Transmission_Unit, 
                                  BleCoCContextCentral.Max_Payload_Size, 
                                  BleCoCContextCentral.Initial_Credits, 
                                  BleCoCContextCentral.Channel_Number);
      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("  Fail   : aci_l2cap_coc_connect command, result: 0x%02X\n", ret);
      }
      else
      {
        APP_DBG_MSG("  Success: aci_l2cap_coc_connect command\n");
      }
    }
      break;

    case BLE_DISCON_HANDLE_EVT :
      {
        BSP_LED_Off(LED_BLUE); 
      }
      break;
      
    case L2CAP_DATA_RECEIVED:
    {
      /* display received data */
      for (i = 0 ; i < pNotification->DataLength ; i++)
      {
        APP_DBG_MSG("%c", pNotification->DataTable[i]);
      }
    }
    break;

    default:
      break;
  }
  return;
}
/* USER CODE END LF */
